html_guide = (
        """
        Крок 1: Запуск програми
        Запустіть програму, використовуючи командний рядок або інший спосіб виклику Python-скрипта.

        Крок 2: Вибір файлу Excel з адресами
        2.1. Натисніть кнопку "Виберіть файл Excel".
        2.2. Оберіть файл Excel із списком електронних адрес у форматі ".xlsx".
        2.3. Якщо файл успішно завантажено, ви побачите повідомлення "Файл Excel успішно завантажено."

        Крок 3: Прикріплення файлів до листа
        3.1. Натисніть кнопку "Прикріпити файли".
        3.2. Оберіть один чи кілька файлів для прикріплення до листа.
        3.3. Кількість прикріплених файлів відображається на екрані.

        Крок 4: Заповнення інформації для листа
        4.1. Введіть тему листа в поле "Тема листа".
        4.2. Введіть текст повідомлення в поле "Повідомлення".

        Крок 5: Перегляд листа перед надсиланням
        5.1. Натисніть кнопку "Перегляд листа", щоб переглянути зміст електронного листа перед надсиланням.

        Крок 6: Надсилання електронних листів
        6.1. Після введення всієї необхідної інформації, натисніть кнопку "Надіслати листи".
        6.2. Якщо листи успішно відправлені, ви побачите повідомлення "Листи успішно надіслано" та кількість надісланих листів.
        

        Ось основні HTML-теги, які ви можете використовувати при написанні листа:
        <b></b> - Жирний
        <i></i> - Курсив
        <u></u> - Підкреслений
        <p></p> - Параграф
        <ul><li>Item 1</li><li>Item 2</li></ul> - Unordered list
        <ol><li>Item 1</li><li>Item 2</li></ol> - Ordered list
        <h1>Heading 1</h1> to <h6>Heading 6</h6> - Headings
        """)